evidence/SW-JOURNAL-002-A1-F37-F38-20260906/patches/tools__mutation__system_pane_write_mutations.js.patch
# utc: 2026-09-06T19:22:08.471153+00:00
# producer: Codex Step6 evidence
--- a/tools/mutation/system_pane_write_mutations.js
+++ b/tools/mutation/system_pane_write_mutations.js
@@ -278,7 +278,14 @@
 // HANDLER_TOP x1, makeWindow x1, resume-input CALL x1 (raw signature x2 including its
 // declaration, unchanged from preimage), REAL_DISARM x1, residue name x4.
 // Both harnesses must be re-run on these exact bytes; the pin alone asserts no outcome.
-  [MAIN]: "8C2CBC94C055CA74B14378FE7F07E49EE15507AD2F28E7F348F150E261695F76",
+// Re-pinned for SW-JOURNAL-002-A1, narrowed to F-37/F-38. main.js now shares the
+// measured roster/view accompaniment between typed and classified voice chat, retains each
+// turn's view notice, and counts returned observed answers for the session roster. Delegation
+// arguments/results and journal writers are unchanged. Chat still calls the existing guarded
+// deliverConductorChat; no new PTY write, pane:input edge, or authority-release sink is added.
+// Re-counted the actual anchor constants (each x1), residue name x4, and all splice sequences;
+// verified zero CR bytes. Both harnesses must be run on these bytes with byte-identical restores.
+  [MAIN]: "43D79F5C7D8B6521DBFA67708D6626BF8DD18AD1AAE96393EFB1A616795D2B35",
   // Added at 19.9 with M3. Its suite drives a modal refusal and proves zero prompt writes,
   // replacing the old circular source-order assertion over main.js.
   [CONDUCTOR_READINESS]: "B264243DF664E5DD75EA4B582B51C386E973EF84FA9A80E4FDEC623F3EA21D49",
